<!-- dflook/terraform-github-actions {"workspace":"default","backend_type":"s3","backend":"e09d3ccd536af28bbcd7cf1b761dc75175bc1ced29643bcd31a40f3b8b4d8944","plan_job_ref":"Job terraform plan #106 at https://github.com/suzutan/infra/actions/runs/15217378126","plan_out_hash":"d5d7e6a746c0abee888353faf345131446c436d6ff902ca094eeff384f8e23c9","plan_hash":"d52834cf523c2d253c6cd89ace37c65ca2b6b22b4b835c721af70a349ae9875e","plan_text_format":"diff","version":"1.48.0"} -->
Terraform plan in __terraform/harvestasya.org__
<details>
<summary>Plan: 0 to add, 1 to change, 0 to destroy.</summary>

```diff
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
!~  update in-place

Terraform will perform the following actions:

  # cloudflare_zero_trust_tunnel_cloudflared_config.k8s_ingress will be updated in-place
!~  resource "cloudflare_zero_trust_tunnel_cloudflared_config" "k8s_ingress" {
!~      config     = {
!~          ingress        = [
!~              {
!~                  origin_request = {
+                       access                 = (known after apply)
#                        (11 unchanged attributes hidden)
                    }
#                    (3 unchanged attributes hidden)
                },
!~              {
!~                  origin_request = {
+                       access                 = (known after apply)
#                        (11 unchanged attributes hidden)
                    }
#                    (3 unchanged attributes hidden)
                },
!~              {
!~                  origin_request = {
+                       access                 = (known after apply)
#                        (11 unchanged attributes hidden)
                    }
#                    (3 unchanged attributes hidden)
                },
!~              {
!~                  origin_request = {
+                       access                 = (known after apply)
#                        (11 unchanged attributes hidden)
                    }
#                    (3 unchanged attributes hidden)
                },
!~              {
!~                  origin_request = {
+                       access                 = (known after apply)
#                        (11 unchanged attributes hidden)
                    }
#                    (3 unchanged attributes hidden)
                },
!~              {
!~                  origin_request = {
+                       access                 = (known after apply)
#                        (11 unchanged attributes hidden)
                    }
#                    (3 unchanged attributes hidden)
                },
!~              {
!~                  origin_request = {
+                       access                 = (known after apply)
#                        (11 unchanged attributes hidden)
                    }
#                    (3 unchanged attributes hidden)
                },
!~              {
!~                  origin_request = {
+                       access                 = (known after apply)
#                        (11 unchanged attributes hidden)
                    }
#                    (3 unchanged attributes hidden)
                },
!~              {
!~                  origin_request = {
+                       access                 = (known after apply)
#                        (11 unchanged attributes hidden)
                    }
#                    (3 unchanged attributes hidden)
                },
!~              {
+                   origin_request = (known after apply)
#                    (2 unchanged attributes hidden)
                },
            ]
+           origin_request = (known after apply)
!~          warp_routing   = {
!~              enabled = false -> (known after apply)
            } -> (known after apply)
        }
!~      created_at = "2025-05-18T05:22:51Z" -> (known after apply)
        id         = "36d574cb-f554-4320-a995-61af899df181"
!~      source     = "cloudflare" -> "local"
!~      version    = 2 -> (known after apply)
#        (2 unchanged attributes hidden)
    }

Plan: 0 to add, 1 to change, 0 to destroy.
```
</details>

:memo: Plan generated in [terraform plan #106](https://github.com/suzutan/infra/actions/runs/15217378126)